platformio/platform-ststm32/misc/svd/STM32F746.svd
            <register>
               <name>CSR48</name>
               <displayName>CSR48</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1B8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR48</name>
                     <description>CSR48</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR49</name>
               <displayName>CSR49</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1BC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR49</name>
                     <description>CSR49</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR50</name>
               <displayName>CSR50</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1C0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR50</name>
                     <description>CSR50</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR51</name>
               <displayName>CSR51</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1C4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR51</name>
                     <description>CSR51</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR52</name>
               <displayName>CSR52</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1C8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR52</name>
                     <description>CSR52</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR53</name>
               <displayName>CSR53</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1CC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR53</name>
                     <description>CSR53</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HASH_HR0</name>
               <displayName>HASH_HR0</displayName>
               <description>HASH digest register</description>
               <addressOffset>0x310</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>H0</name>
                     <description>H0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HASH_HR1</name>
               <displayName>HASH_HR1</displayName>
               <description>read-only</description>
               <addressOffset>0x314</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>H1</name>
                     <description>H1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HASH_HR2</name>
               <displayName>HASH_HR2</displayName>
               <description>read-only</description>
               <addressOffset>0x318</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>H2</name>
                     <description>H2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HASH_HR3</name>
               <displayName>HASH_HR3</displayName>
               <description>read-only</description>
               <addressOffset>0x31C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>H3</name>
                     <description>H3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HASH_HR4</name>
               <displayName>HASH_HR4</displayName>
               <description>read-only</description>
               <addressOffset>0x320</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>H4</name>
                     <description>H4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HASH_HR5</name>
               <displayName>HASH_HR5</displayName>
               <description>read-only</description>
               <addressOffset>0x324</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>H5</name>
                     <description>H5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HASH_HR6</name>
               <displayName>HASH_HR6</displayName>
               <description>read-only</description>
               <addressOffset>0x328</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>H6</name>
                     <description>H6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HASH_HR7</name>
               <displayName>HASH_HR7</displayName>
               <description>read-only</description>
               <addressOffset>0x32C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>H7</name>
                     <description>H7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
