platformio/platform-ststm32/misc/svd/STM32F746.svd
            <register>
               <name>OTG_FS_HCTSIZ4</name>
               <displayName>OTG_FS_HCTSIZ4</displayName>
               <description>OTG_FS host channel-x transfer size           register</description>
               <addressOffset>0x190</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCTSIZ5</name>
               <displayName>OTG_FS_HCTSIZ5</displayName>
               <description>OTG_FS host channel-5 transfer size           register</description>
               <addressOffset>0x1B0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCTSIZ6</name>
               <displayName>OTG_FS_HCTSIZ6</displayName>
               <description>OTG_FS host channel-6 transfer size           register</description>
               <addressOffset>0x1D0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCTSIZ7</name>
               <displayName>OTG_FS_HCTSIZ7</displayName>
               <description>OTG_FS host channel-7 transfer size           register</description>
               <addressOffset>0x1F0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCCHAR8</name>
               <displayName>OTG_FS_HCCHAR8</displayName>
               <description>OTG_FS host channel-8 characteristics           register</description>
               <addressOffset>0x1F4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EPDIR</name>
                     <description>Endpoint direction</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSDEV</name>
                     <description>Low-speed device</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>Multicount</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DAD</name>
                     <description>Device address</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>ODDFRM</name>
                     <description>Odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHENA</name>
                     <description>Channel enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCINT8</name>
               <displayName>OTG_FS_HCINT8</displayName>
               <description>OTG_FS host channel-8 interrupt           register</description>
               <addressOffset>0x1F8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHH</name>
                     <description>Channel halted</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALL</name>
                     <description>STALL response received               interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK response received               interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACK</name>
                     <description>ACK response received/transmitted               interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERR</name>
                     <description>Transaction error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBERR</name>
                     <description>Babble error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMOR</name>
                     <description>Frame overrun</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTERR</name>
                     <description>Data toggle error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCINTMSK8</name>
               <displayName>OTG_FS_HCINTMSK8</displayName>
               <description>OTG_FS host channel-8 mask           register</description>
               <addressOffset>0x1FC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XFRCM</name>
                     <description>Transfer completed mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHHM</name>
                     <description>Channel halted mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLM</name>
                     <description>STALL response received interrupt               mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKM</name>
                     <description>NAK response received interrupt               mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACKM</name>
                     <description>ACK response received/transmitted               interrupt mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>response received interrupt               mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERRM</name>
                     <description>Transaction error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBERRM</name>
                     <description>Babble error mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMORM</name>
                     <description>Frame overrun mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTERRM</name>
                     <description>Data toggle error mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCTSIZ8</name>
               <displayName>OTG_FS_HCTSIZ8</displayName>
               <description>OTG_FS host channel-8 transfer size           register</description>
               <addressOffset>0x200</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCCHAR9</name>
               <displayName>OTG_FS_HCCHAR9</displayName>
               <description>OTG_FS host channel-9 characteristics           register</description>
               <addressOffset>0x204</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EPDIR</name>
                     <description>Endpoint direction</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSDEV</name>
                     <description>Low-speed device</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>Multicount</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DAD</name>
                     <description>Device address</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>ODDFRM</name>
                     <description>Odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHENA</name>
                     <description>Channel enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCINT9</name>
               <displayName>OTG_FS_HCINT9</displayName>
               <description>OTG_FS host channel-9 interrupt           register</description>
               <addressOffset>0x208</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHH</name>
                     <description>Channel halted</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALL</name>
                     <description>STALL response received               interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK response received               interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACK</name>
                     <description>ACK response received/transmitted               interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERR</name>
                     <description>Transaction error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBERR</name>
                     <description>Babble error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMOR</name>
                     <description>Frame overrun</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTERR</name>
                     <description>Data toggle error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HCINTMSK9</name>
               <displayName>OTG_FS_HCINTMSK9</displayName>
               <description>OTG_FS host channel-9 mask           register</description>
               <addressOffset>0x20C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XFRCM</name>
                     <description>Transfer completed mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHHM</name>
                     <description>Channel halted mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLM</name>
                     <description>STALL response received interrupt               mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKM</name>
                     <description>NAK response received interrupt               mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACKM</name>
                     <description>ACK response received/transmitted               interrupt mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>response received interrupt               mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERRM</name>
                     <description>Transaction error mask</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBERRM</name>
                     <description>Babble error mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMORM</name>
                     <description>Frame overrun mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTERRM</name>
                     <description>Data toggle error mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
