platformio/platform-ststm32/misc/svd/STM32F746.svd
            <register>
               <name>OTG_HS_HCSPLT0</name>
               <displayName>OTG_HS_HCSPLT0</displayName>
               <description>OTG_HS host channel-0 split control           register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT1</name>
               <displayName>OTG_HS_HCSPLT1</displayName>
               <description>OTG_HS host channel-1 split control           register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT2</name>
               <displayName>OTG_HS_HCSPLT2</displayName>
               <description>OTG_HS host channel-2 split control           register</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT3</name>
               <displayName>OTG_HS_HCSPLT3</displayName>
               <description>OTG_HS host channel-3 split control           register</description>
               <addressOffset>0x164</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT4</name>
               <displayName>OTG_HS_HCSPLT4</displayName>
               <description>OTG_HS host channel-4 split control           register</description>
               <addressOffset>0x184</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT5</name>
               <displayName>OTG_HS_HCSPLT5</displayName>
               <description>OTG_HS host channel-5 split control           register</description>
               <addressOffset>0x1A4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT6</name>
               <displayName>OTG_HS_HCSPLT6</displayName>
               <description>OTG_HS host channel-6 split control           register</description>
               <addressOffset>0x1C4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT7</name>
               <displayName>OTG_HS_HCSPLT7</displayName>
               <description>OTG_HS host channel-7 split control           register</description>
               <addressOffset>0x1E4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT8</name>
               <displayName>OTG_HS_HCSPLT8</displayName>
               <description>OTG_HS host channel-8 split control           register</description>
               <addressOffset>0x204</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT9</name>
               <displayName>OTG_HS_HCSPLT9</displayName>
               <description>OTG_HS host channel-9 split control           register</description>
               <addressOffset>0x224</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT10</name>
               <displayName>OTG_HS_HCSPLT10</displayName>
               <description>OTG_HS host channel-10 split control           register</description>
               <addressOffset>0x244</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT11</name>
               <displayName>OTG_HS_HCSPLT11</displayName>
               <description>OTG_HS host channel-11 split control           register</description>
               <addressOffset>0x264</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCINT0</name>
               <displayName>OTG_HS_HCINT0</displayName>
               <description>OTG_HS host channel-11 interrupt           register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHH</name>
                     <description>Channel halted</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHBERR</name>
                     <description>AHB error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALL</name>
                     <description>STALL response received               interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK response received               interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACK</name>
                     <description>ACK response received/transmitted               interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>Response received               interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERR</name>
                     <description>Transaction error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBERR</name>
                     <description>Babble error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMOR</name>
                     <description>Frame overrun</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTERR</name>
                     <description>Data toggle error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
